
## Plan Result (terraform/settings)

[CI link](https://github.com/air-hand/dotfiles/actions/runs/9839240800)


<pre><code>Plan: 3 to import, 1 to add, 3 to change, 0 to destroy.</code></pre>

* Create
  * github_issue_label.dependencies[&#34;major&#34;]
* Update
  * github_issue_label.dependencies[&#34;dependencies&#34;]
  * github_issue_label.dependencies[&#34;minor&#34;]
  * github_issue_label.dependencies[&#34;patch&#34;]
* Import
  * github_issue_label.dependencies[&#34;dependencies&#34;]
  * github_issue_label.dependencies[&#34;minor&#34;]
  * github_issue_label.dependencies[&#34;patch&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # github_issue_label.dependencies["dependencies"] will be updated in-place
  # (imported from "dotfiles:dependencies")
  ~ resource "github_issue_label" "dependencies" {
      ~ color       = "0366d6" -> "0366D6"
        description = "Pull requests that update a dependency file"
        etag        = "W/\"1bda92dd505ff0436472a40f77de54d132f078e44bdf34a091531a9fd7f21f09\""
        id          = "dotfiles:dependencies"
        name        = "dependencies"
        repository  = "dotfiles"
        url         = "https://api.github.com/repos/air-hand/dotfiles/labels/dependencies"
    }

  # github_issue_label.dependencies["major"] will be created
  + resource "github_issue_label" "dependencies" {
      + color      = "FF0000"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "major"
      + repository = "dotfiles"
      + url        = (known after apply)
    }

  # github_issue_label.dependencies["minor"] will be updated in-place
  # (imported from "dotfiles:minor")
  ~ resource "github_issue_label" "dependencies" {
      ~ color       = "ededed" -> "00FF00"
        description = null
        etag        = "W/\"419541625d776a5ef3e0b717d16b725e7fd5ba720f24837a52ff8c6c43adce97\""
        id          = "dotfiles:minor"
        name        = "minor"
        repository  = "dotfiles"
        url         = "https://api.github.com/repos/air-hand/dotfiles/labels/minor"
    }

  # github_issue_label.dependencies["patch"] will be updated in-place
  # (imported from "dotfiles:patch")
  ~ resource "github_issue_label" "dependencies" {
      ~ color       = "ededed" -> "0000FF"
        description = null
        etag        = "W/\"807b0cd322e17b1e993a1f2f6fb3e35db657f9f6faae9ae8f6b56a69613bd1eb\""
        id          = "dotfiles:patch"
        name        = "patch"
        repository  = "dotfiles"
        url         = "https://api.github.com/repos/air-hand/dotfiles/labels/patch"
    }

Plan: 3 to import, 1 to add, 3 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":159,"Program":"tfcmt","SHA1":"3eda11abf775c91e1621d7b36642c1f4bbfe5835","Target":"terraform/settings","Vars":{},"WorkflowName":"Terraform plan and apply"} -->